import { Metadata } from "next";
import LocalNavbar from "@/components/shared/local-navbar";
import UnitForm from "./unit-form";

export const metadata: Metadata = {
  title: "تبدیل واحد",
  description:
    "تبدیل واحد آنلاین و مبدل واحدهای فشار وزن طول نیرو انرژی حجم سرعت مساحت زمان حافظه دیجیتال پهنای باند و تبدیل سایر واحدها و یکاهای اندازه گیری",
  keywords: [
    "تبدیل بایت به گیگابایت",
    "تبدیل کیلوبایت به مگابایت",
    "تبدیل کیلوبایت به بایت",
    "تبدیل بایت به مگابایت",
    "تبدیل مگابیت به مگابایت",
    "تبدیل مگابایت به گیگابایت",
    "تبدیل واحد",
    "تبدیل کیلوبایت به گیگابایت",
    "تبدیل kb به mb",
    "تبدیل kb به gb",
    "تبديل kb به mb",
    "تبدیل متر به سانتی متر",
    "تبدیل متر به اینچ",
    "تبدیل متر به فوت",
    "تبدیل متر به کیلومتر",
    "تبدیل متر به میلی متر",
    "تبدیل متر به یارد",
    "تبدیل متر به فیت",
    "تبدیل میلی متر به سانتی متر",
    "تبدیل میلی متر به اینچ",
    "تبدیل میلی متر به فوت",
    "تبدیل میلی متر به کیلومتر",
    "تبدیل میلی متر به یارد",
    "تبدیل میلی متر به فیت",
    "تبدیل یارد به سانتی متر",
    "تبدیل یارد به اینچ",
    "تبدیل یارد به فوت",
    "تبدیل یارد به کیلومتر",
    "تبدیل یارد به میلی متر",
    "تبدیل یارد به فیت",
    "تبدیل اینچ به سانتی متر",
    "تبدیل اینچ به فوت",
    "تبدیل اینچ به کیلومتر",
    "تبدیل اینچ به میلی متر",
    "تبدیل اینچ به یارد",
    "تبدیل اینچ به فیت",
    "تبدیل فوت به سانتی متر",
    "تبدیل فوت به کیلومتر",
    "تبدیل فوت به میلی متر",
    "تبدیل فوت به یارد",
    "تبدیل فوت به فیت",
    "تبدیل کیلومتر به سانتی متر",
    "تبدیل کیلومتر به میلی متر",
    "تبدیل کیلومتر به یارد",
    "تبدیل کیلومتر به فیت",
    "تبدیل سانتی متر به فوت",
    "تبدیل سانتی متر به کیلومتر",
    "تبدیل سانتی متر به میلی متر",
    "تبدیل سانتی متر به یارد",
    "تبدیل سانتی متر به فیت",
    "تبدیل ثانیه به دقیقه",
    "تبدیل ثانیه به ساعت",
    "تبدیل ثانیه به میلی ثانیه",
    "تبدیل ثانیه به روز",
    "تبدیل ثانیه به سال",
    "تبدیل ثانیه به ساعت کلاس چهارم",
    "تبدیل ثانیه به دقیقه کلاس چهارم",
    "تبدیل ثانیه به ساعت کلاس پنجم",
    "تبدیل ثانیه به عدد مرکب",
    "تبدیل ثانیه به ساعت و دقیقه",
    "تبدیل روز به ثانیه",
    "تبدیل ماه به ثانیه",
    "تبدیل سال به ثانیه",
    "تبدیل ساعت به ثانیه",
    "تبدیل هفته به ثانیه",
    "تبدیل دقیقه به ثانیه",
    "تبدیل سال و ماه به ثانیه",
  ],

  alternates: {
    canonical: `https://kit365.ir/calc/unit`,
  },
};

const UnitHome = () => {
  return (
    <>
      {/* <LocalNavbar items={navbarItems} /> */}

      <div className="z-10 w-full max-w-3xl px-5 xl:px-0">
        {/* here we add our first client component */}
        <UnitForm />
      </div>
    </>
  );
};
export default UnitHome;
